# Pandas!

In [3]:
import pandas as pd

1. Series
A Series is a one-dimensional labeled array.

It can hold any data type (integers, floats, strings, etc.).

It has an index that labels each element.

Think of it as a column in an Excel sheet or a single list with labels.

## series

In [5]:
# my_series = pd.Series(data,indeex,name)

In [6]:
new_Series = pd.Series(dtype = int)

In [7]:
new_Series

Series([], dtype: int64)

In this example, we're creating an empty series using Pandas. It's like reserving a spot for data, but for now, it's empty. We're telling Pandas that we want it to be a series of whole numbers (dtype = 'int'). It's like setting up a container in advance, even though we haven't put anything in it yet. This can be useful when we plan to add data later on.

#### example

In [35]:
production_data =  [1000,1100,1200,1300,1400,1500,1600]

In [37]:
prodection_day = ['day1','day2','day3','day4','day5','day6','day7',]

In [12]:
my_series = pd.Series(data = production_data,index=prodection_day,name='production details')

In [13]:
my_series

day1    1000
day2    1100
day3    1200
day4    1300
day5    1400
day6    1500
day7    1600
Name: production details, dtype: int64

In [39]:
daily_prodection = pd.Series(data = production_data[1:],index = prodection_day,name = 'production detail')

ValueError: Length of values (6) does not match length of index (7)

In [ ]:
my_series.name

In [ ]:
my_series.index

In [ ]:
my_series.values # in here we dont use data we there values of series

In [ ]:
my_series.dtype

In [ ]:
my_series.shape

In [ ]:
my_series.ndim # dimentional of this serries

In [ ]:
len(my_series)

## DATAFRAMES

pd.DataFrame(data, index, columns, dtype)

In [ ]:
cus_data = [
    ['01','anish verma','anis@gmail.com','9818727396',50],
    ['02','harsh verma','harsh@gmail.com','9818725396',70],
    ['03','khushi verma','harsh@gmail.com','9818724396',90]
]

cus_column = [['COSTUMER ID','NAME','EMAIL','PHONE NO.','TOTAL PURCHASE']]

In [ ]:
df = pd.DataFrame(data=cus_data,columns=cus_column)

In [ ]:
df

In [ ]:
cus_index = ['A','B','C']

In [ ]:
df_ind = pd.DataFrame(data = cus_data,index = cus_index,columns =cus_column)

In [ ]:
df_ind

## Creating DataFrames from Dictionaries

In [ ]:
cus_dict = {
    'COSTUMER ID ':['A','B','C','D'],
    'NAME':['ANISH','HARSH','KHSUHI','ONI'],
    'EMAIL':['anish@gmail.com','harsh@gmail.com','khushi@gmail.com','oninoni@gmail.com'],
    'PHONE NO.':['9818727396','9818747396','9488727396','9818757396'],
    'PURCHASE':[50,20,10,40]
}

In [ ]:
new_df = pd.DataFrame(cus_dict,index = ['a','b','c','d'])

In [ ]:
new_df

## READING DATA FROM SYSTEM FILE

##### pd.read_csv(filepath_or_buffer, index_col=None, dtype=None)

Let’s look at the function in more detail:

pd.read_csv: This is a function provided by the pandas library specifically designed for reading data from CSV files.

filepath_or_buffer: This is the path or URL of the CSV file you want to read. You should replace filepath_or_buffer with the actual file path or URL.

index_col: This parameter is optional. It specifies which column(s) should be used as the index (row labels) of the resulting DataFrame. If not provided, pandas will automatically assign integer indices.

dtype: This parameter is optional. It allows you to specify the data types for the columns in the DataFrame. If not provided, pandas will infer the data types.

In [ ]:
df_read = pd.read_csv('anish.csv')

In [ ]:
df_read

In [ ]:
new_read  = pd.read_csv(filepath_or_buffer = 'anish.csv',index_col ='name' )

In [ ]:
new_read

In [53]:
read_carprice = pd.read_csv('carprices.csv')

In [57]:
read_carprice

,car_ID,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,...,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
0,1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
1,2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
2,3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,...,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0
3,4,2,audi 100 ls,four,sedan,front,99.8,176.6,66.2,54.3,...,four,109,3.19,3.40,10.0,102,5500,24,30,13950.0
4,5,2,audi 100ls,four,sedan,front,99.4,176.6,66.4,54.3,...,five,136,3.19,3.40,8.0,115,5500,18,22,17450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,201,-1,volvo 145e (sw),four,sedan,front,109.1,188.8,68.9,55.5,...,four,141,3.78,3.15,9.5,114,5400,23,28,16845.0
201,202,-1,volvo 144ea,four,sedan,front,109.1,188.8,68.8,55.5,...,four,141,3.78,3.15,8.7,160,5300,19,25,19045.0
202,203,-1,volvo 244dl,four,sedan,front,109.1,188.8,68.9,55.5,...,six,173,3.58,2.87,8.8,134,5500,18,23,21485.0
203,204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,...,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0
204,205,-1,volvo 264gl,four,sedan,front,109.1,188.8,68.9,55.5,...,four,141,3.78,3.15,9.5,114,5400,19,25,22625.0

In [49]:
read_movierating = pd.read_csv('User_Movie_Ratings.csv',index_col = None) # index_col/set_index both are same

In [51]:
read_movierating

,User,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
0,Arnold,6,5,6,4,5,4,9,8,2,1
1,Ben,9,10,8,3,1,1,2,5,7,8
2,Catherine,10,8,9,5,6,7,8,5,9,9
3,Disha,6,7,7,10,9,10,7,6,5,6
4,Euclid,7,4,3,5,8,5,9,10,8,7
5,Farhaan,6,5,9,4,4,7,9,9,5,4
6,Gaurav,8,8,9,3,1,1,7,5,7,7
7,Hilbert,6,5,8,6,5,8,10,9,2,1
8,Indira,10,7,9,5,6,4,2,1,6,8
9,Jason,10,9,9,7,4,6,1,1,5,4
10,Kenny,3,2,5,9,8,8,4,1,1,3
11,Lambert,5,6,4,10,9,8,1,2,10,9
12,Manish,7,6,6,5,6,8,7,6,6,5
13,Niti,3,3,2,7,8,7,10,9,4,5
14,Oliver,4,5,4,2,2,1,7,6,1,2
15,Pranav,8,9,8,4,1,2,3,1,8,7
16,Qader,8,7,8,5,4,6,3,4,6,5
17,Ravi,8,7,9,10,9,8,8,8,9,10
18,Sushant,5,8,6,1,1,2,7,8,6,5
19,Tavneet,1,1,4,7,6,8,9,10,1,5

In [ ]:
dfr = pd.read_clipboard()

In [ ]:
dfr.set_index('User')

#### head and tail

In [ ]:
read_movierating.head()

In [ ]:
read_movierating.head(3)

In [ ]:
# head show default the first 5 entry and element

In [ ]:
read_movierating.tail()

In [ ]:
read_movierating.tail(2)

In [ ]:
# tail show default last 5 entry

In [ ]:
read_carprice.axes

In [ ]:
read_carprice.index

In [ ]:
read_carprice.columns

In [ ]:
len(read_carprice)

In [ ]:
read_carprice.shape

In [ ]:
read_carprice.size

In [ ]:
read_carprice.dtypes

In [ ]:
read_carprice.info()

In [ ]:
read_carprice.keys()

In [ ]:
read_carprice.values

In [ ]:
read_movierating.transpose() # simple meaning is that it change the angle

## Accessing Data From DataFrames

### Direct Access

In [ ]:
read_carprice.carname # variable.columns

In [ ]:
read_movierating['Spiderman']

In [ ]:
read_movierating[['Annabelle','Thor']] # use double bracket

In [ ]:
read_movierating['Thor'][2] # read_movierating['column name'][index number it can be string or int]

In [ ]:
excel = pd.read_excel('room_expenditure.xlsx',index_col = 'Room')

In [ ]:
excel

In [ ]:
excel['Expenditure'][0:5]

In [ ]:
excel['Expenditure']['A5']

In [ ]:
excel[A1]

In [ ]:
excel = excel.transpose()

In [ ]:
excel

In [ ]:
excel['A1'] #Now we can use the ‘Room’ row values as column indices.

### The loc indexer (Label-based Indexing)

1. .loc[] (Label-based Indexing)
Uses labels (index names) to select rows and columns.

Includes both start and end values in slicing.

Syntax: df.loc[row_label, column_label]

The syntax for using loc is typically df.loc[row_label, column_label], where row_label and column_label are the labels of the row and column you want to access, respectively. Consider the following example.

In [114]:
excel2 = pd.read_excel('room_expenditure.xlsx',index_col = None)

In [116]:
excel2

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [84]:
excel2.loc[0]

Room               A1
Name           Shilpa
Age                18
Cuisine        Indian
Expenditure     24.65
Name: 0, dtype: object

In [65]:
excel2.loc[5,'Age']

np.int64(31)

In [67]:
excel2.loc[:,'Age']

0    18
1    32
2    19
3    22
4    28
5    31
6    48
7    67
8    24
9    29
Name: Age, dtype: int64

In [69]:
excel2[['Age','Expenditure']]

   Age  Expenditure
0   18        24.65
1   32        18.54
2   19        27.66
3   22        19.54
4   28        17.32
5   31        12.56
6   48        11.09
7   67        12.23
8   24        18.88
9   29        14.43

In [88]:
excel2.loc[0,['Age','Expenditure']]

Age               18
Expenditure    24.65
Name: 0, dtype: object

In [122]:
excel2.loc[1:6,['Age','Expenditure']]

   Age  Expenditure
1   32        18.54
2   19        27.66
3   22        19.54
4   28        17.32
5   31        12.56
6   48        11.09

In [148]:
excel2.loc[0:5,['Age','Expenditure']]

   Age  Expenditure
0   18        24.65
1   32        18.54
2   19        27.66
3   22        19.54
4   28        17.32
5   31        12.56

## iloc (Integer-based Indexing)

2. .iloc[] (Integer-based Indexing)
Uses integer positions (0-based index) to select rows and columns.

Excludes the end value in slicing (like Python’s range).

Syntax: df.iloc[row_index, column_index]

In [159]:
excel2.iloc[0]

Room               A1
Name           Shilpa
Age                18
Cuisine        Indian
Expenditure     24.65
Name: 0, dtype: object

In [163]:
excel2.iloc[0:5,0:2]

  Room      Name
0   A1    Shilpa
1   A2  Jaspreet
2   A3   Dominic
3   A4     Ahmad
4   A5    Joseph

In [169]:
# if you  want specific row and specific column 
#use
excel2.iloc[[1,3,4,6],[0,2,4]]

  Room  Age  Expenditure
1   A2   32        18.54
3   A4   22        19.54
4   A5   28        17.32
6   A7   48        11.09

In [171]:
print(type(excel2.iloc[[1,3,4,6],[0,2,4]]))

<class 'pandas.core.frame.DataFrame'>

## Conditional (boolean) indexing

In [176]:
excel2['Expenditure']>15

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
8     True
9    False
Name: Expenditure, dtype: bool

In [178]:
excel2[excel2['Expenditure']>15]

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
8   A9      Emma   24    Indian        18.88

In [184]:
excel2[[excel2['Expenditure']>15] & [excel2['Cuisine']=='Indian']]

TypeError: unsupported operand type(s) for &: 'list' and 'list'

In [187]:
excel2[(excel2['Expenditure']>15) & (excel2['Cuisine']=='Indian')]

  Room     Name  Age Cuisine  Expenditure
0   A1   Shilpa   18  Indian        24.65
2   A3  Dominic   19  Indian        27.66
4   A5   Joseph   28  Indian        17.32
8   A9     Emma   24  Indian        18.88

Using & (AND operator):

Both conditions must be inside () parentheses to avoid operator precedence issues.

In [196]:
excel2[excel2['Cuisine'].isin(['Indian'])]

  Room     Name  Age Cuisine  Expenditure
0   A1   Shilpa   18  Indian        24.65
2   A3  Dominic   19  Indian        27.66
4   A5   Joseph   28  Indian        17.32
5   A6     Saju   31  Indian        12.56
8   A9     Emma   24  Indian        18.88

#### question

In [17]:
cars = pd.read_csv('cars_dataset.csv',index_col = None)

In [19]:
cars

,car_ID,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,...,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
0,1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
1,2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
2,3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,...,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0
3,4,2,audi 100 ls,four,sedan,front,99.8,176.6,66.2,54.3,...,four,109,3.19,3.40,10.0,102,5500,24,30,13950.0
4,5,2,audi 100ls,four,sedan,front,99.4,176.6,66.4,54.3,...,five,136,3.19,3.40,8.0,115,5500,18,22,17450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
142,197,-2,volvo 244dl,four,sedan,front,104.3,188.8,67.2,56.2,...,four,141,3.78,3.15,9.5,114,5400,24,28,15985.0
143,198,-1,volvo 245,four,wagon,front,104.3,188.8,67.2,57.5,...,four,141,3.78,3.15,9.5,114,5400,24,28,16515.0
144,199,-2,volvo 264gl,four,sedan,front,104.3,188.8,67.2,56.2,...,four,130,3.62,3.15,7.5,162,5100,17,22,18420.0
145,200,-1,volvo diesel,four,wagon,front,104.3,188.8,67.2,57.5,...,four,130,3.62,3.15,7.5,162,5100,17,22,18950.0
146,204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,...,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0

In [207]:
cars.carname

0            alfa-romero giulia
1           alfa-romero stelvio
2      alfa-romero Quadrifoglio
3                   audi 100 ls
4                    audi 100ls
                 ...
142                 volvo 244dl
143                   volvo 245
144                 volvo 264gl
145                volvo diesel
146                   volvo 246
Name: carname, Length: 147, dtype: object

In [215]:
cars['carname']

0            alfa-romero giulia
1           alfa-romero stelvio
2      alfa-romero Quadrifoglio
3                   audi 100 ls
4                    audi 100ls
                 ...
142                 volvo 244dl
143                   volvo 245
144                 volvo 264gl
145                volvo diesel
146                   volvo 246
Name: carname, Length: 147, dtype: object

In [219]:
cars.get('carname')

0            alfa-romero giulia
1           alfa-romero stelvio
2      alfa-romero Quadrifoglio
3                   audi 100 ls
4                    audi 100ls
                 ...
142                 volvo 244dl
143                   volvo 245
144                 volvo 264gl
145                volvo diesel
146                   volvo 246
Name: carname, Length: 147, dtype: object

In [225]:
cars[['carname','price']]

                      carname    price
0          alfa-romero giulia  13495.0
1         alfa-romero stelvio  16500.0
2    alfa-romero Quadrifoglio  16500.0
3                 audi 100 ls  13950.0
4                  audi 100ls  17450.0
..                        ...      ...
142               volvo 244dl  15985.0
143                 volvo 245  16515.0
144               volvo 264gl  18420.0
145              volvo diesel  18950.0
146                 volvo 246  22470.0

[147 rows x 2 columns]

In [23]:
cars.loc[:,['carname','price']]

                      carname    price
0          alfa-romero giulia  13495.0
1         alfa-romero stelvio  16500.0
2    alfa-romero Quadrifoglio  16500.0
3                 audi 100 ls  13950.0
4                  audi 100ls  17450.0
..                        ...      ...
142               volvo 244dl  15985.0
143                 volvo 245  16515.0
144               volvo 264gl  18420.0
145              volvo diesel  18950.0
146                 volvo 246  22470.0

[147 rows x 2 columns]

#  Pandas Operations!

## Series operations

In [41]:
production_data = [1000, 1200, 1100, 950, 1050, 1430, 1760]

In [43]:
production_day = ['Day1', 'Day2', 'Day3', 'Day4', 'Day5', 'Day6', 'Day7']

In [45]:
production = pd.Series(production_day,production_data,name = 'daily production')

In [49]:
production

1000    Day1
1200    Day2
1100    Day3
950     Day4
1050    Day5
1430    Day6
1760    Day7
Name: daily production, dtype: object

#### rename()

In [55]:
production.rename(index = 'name is change')

1000    Day1
1200    Day2
1100    Day3
950     Day4
1050    Day5
1430    Day6
1760    Day7
Name: name is change, dtype: object

In [60]:
# another way to change the name 
production.name = 'another way to change the name'

In [62]:
production

1000    Day1
1200    Day2
1100    Day3
950     Day4
1050    Day5
1430    Day6
1760    Day7
Name: another way to change the name, dtype: object

Let’s create a series using NumPy arrays.

In [67]:
import numpy as np

In [69]:
array1 = np.array(['anish','khushi','harshu','panu'])

In [71]:
array2 = np.array([100,120,130,140])

In [73]:
series2 = pd.Series(array1,array2,name = 'bhai bhen')

In [77]:
print(series2)

100     anish
120    khushi
130    harshu
140      panu
Name: bhai bhen, dtype: object

####  Applying condition

In [79]:
production_data = [1000, 1200, 1100, 950, 1050, 1430, 1760]

In [81]:
production_day = ['Day1', 'Day2', 'Day3', 'Day4', 'Day5', 'Day6', 'Day7']

In [91]:
daily_production = pd.Series(production_data,prodection_day,name = 'daily production')

In [93]:
daily_production

day1    1000
day2    1200
day3    1100
day4     950
day5    1050
day6    1430
day7    1760
Name: daily production, dtype: int64

In [99]:
daily_production[daily_production>1000]

day2    1200
day3    1100
day5    1050
day6    1430
day7    1760
Name: daily production, dtype: int64

In [103]:
daily_production[(daily_production > 1000) & (daily_production < 1500)]

day2    1200
day3    1100
day5    1050
day6    1430
Name: daily production, dtype: int64

In [ ]:
# another way

In [105]:
show = (daily_production >100) & (daily_production<1500)

In [111]:
print(daily_production[show])

day1    1000
day2    1200
day3    1100
day4     950
day5    1050
day6    1430
Name: daily production, dtype: int64

## DataFrame Operations

In [5]:
room_exp = pd.read_excel('room_expenditure.xlsx')

In [7]:
room_exp

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [188]:
# Converting floating point values to integers
room_exp['Expenditure'].astype(int)

0    24
1    18
2    27
3    19
4    17
5    12
6    11
7    12
8    18
9    14
Name: Expenditure, dtype: int64

In [190]:
room_exp.dtypes

Room            object
Name            object
Age              int64
Cuisine         object
Expenditure    float64
dtype: object

In [9]:
newroom = room_exp.convert_dtypes()

In [194]:
newroom.dtypes

Room           string[python]
Name           string[python]
Age                     Int64
Cuisine        string[python]
Expenditure           Float64
dtype: object

In [198]:
newroom['Expenditure']+100

0    124.65
1    118.54
2    127.66
3    119.54
4    117.32
5    112.56
6    111.09
7    112.23
8    118.88
9    114.43
Name: Expenditure, dtype: Float64

In [200]:
newroom

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [202]:
newroom['Expenditure']-10

0    14.65
1     8.54
2    17.66
3     9.54
4     7.32
5     2.56
6     1.09
7     2.23
8     8.88
9     4.43
Name: Expenditure, dtype: Float64

In [214]:
newroom.loc[0:5,['Expenditure']].add(100)

   Expenditure
0       124.65
1       118.54
2       127.66
3       119.54
4       117.32
5       112.56

In Pandas' .loc[] indexing, the end index is inclusive, unlike .iloc[], where the end index is exclusive.

The '.add()' method allows you to specify a fill_value argument. For instance, if there are NaN values, you can fill them with a value (like 0) before performing the addition. In this case, it can fill any NaN in the Age column with 0 before adding 5.

In [217]:
newroom['Age'].add(5, fill_value=0)

0    23
1    37
2    24
3    27
4    33
5    36
6    53
7    72
8    29
9    34
Name: Age, dtype: Int64

Likewise, to perform subtraction we can use the sub() function as follows.

In [225]:
newroom['Age'].sub(10)

0     8
1    22
2     9
3    12
4    18
5    21
6    38
7    57
8    14
9    19
Name: Age, dtype: Int64

In [231]:
newroom['Age'].div(5)

0     3.6
1     6.4
2     3.8
3     4.4
4     5.6
5     6.2
6     9.6
7    13.4
8     4.8
9     5.8
Name: Age, dtype: Float64

In [233]:
newroom['Age'].mul(100)

0    1800
1    3200
2    1900
3    2200
4    2800
5    3100
6    4800
7    6700
8    2400
9    2900
Name: Age, dtype: Int64

We can also perform inter-column operations, meaning, adding or subtracting two columns. Consider the following example.

In [238]:
newroom['Age'] + newroom['Expenditure'] # in here twoo different column add each other

0    42.65
1    50.54
2    46.66
3    41.54
4    45.32
5    43.56
6    59.09
7    79.23
8    42.88
9    43.43
dtype: Float64

In [240]:
newroom['Age']+room_exp['Expenditure'] # in her two different column from different files

0    42.65
1    50.54
2    46.66
3    41.54
4    45.32
5    43.56
6    59.09
7    79.23
8    42.88
9    43.43
dtype: Float64

we can perform inter-column addition between string columns.  However, the result obtained would be a dataframe object with the strings concatenated.  See the following example.

In [251]:
newroom['Name']+newroom['Cuisine']

0        ShilpaIndian
1    JaspreetAmerican
2       DominicIndian
3       AhmadAmerican
4        JosephIndian
5          SajuIndian
6       MonicaChinese
7      PreetiAmerican
8          EmmaIndian
9       GauravChinese
dtype: string

newroom['Full_Info'] = newroom['Name'] + ' ' + newroom['Cuisine']
print(newroom[['Full_Info']])  # Display the new column in between space  this is my experiment

In [268]:
newroom.round()

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian         25.0
1   A2  Jaspreet   32  American         19.0
2   A3   Dominic   19    Indian         28.0
3   A4     Ahmad   22  American         20.0
4   A5    Joseph   28    Indian         17.0
5   A6      Saju   31    Indian         13.0
6   A7    Monica   48   Chinese         11.0
7   A8    Preeti   67  American         12.0
8   A9      Emma   24    Indian         19.0
9  A10    Gaurav   29   Chinese         14.0

## Statistical Operations

In [279]:
newroom['Expenditure'].sum()

np.float64(176.9)

In [281]:
newroom['Expenditure'].mean()

np.float64(17.69)

In [283]:
newroom['Expenditure'].max()

np.float64(27.66)

In [285]:
newroom['Expenditure'].min()

np.float64(11.09)

In [21]:
newroom['Expenditure'].idxmin() #The code df['Age'].idxmin() is used in pandas to find the index of the row where the minimum value occurs in the 'Age' column.

6

In [23]:
newroom['Expenditure'].idxmax()

2

In [27]:
newroom.describe()

             Age  Expenditure
count       10.0         10.0
mean        31.8        17.69
std    15.039208     5.414554
min         18.0        11.09
25%         22.5      13.0275
50%         28.5        17.93
75%        31.75       19.375
max         67.0        27.66

In [35]:
newroom['Cuisine'].mode()

0    Indian
Name: Cuisine, dtype: string

In [37]:
newroom.sort_values(['Expenditure'])

  Room      Name  Age   Cuisine  Expenditure
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
5   A6      Saju   31    Indian        12.56
9  A10    Gaurav   29   Chinese        14.43
4   A5    Joseph   28    Indian        17.32
1   A2  Jaspreet   32  American        18.54
8   A9      Emma   24    Indian        18.88
3   A4     Ahmad   22  American        19.54
0   A1    Shilpa   18    Indian        24.65
2   A3   Dominic   19    Indian        27.66

In [49]:
newroom.sort_values(['Expenditure'],ascending = False)

  Room      Name  Age   Cuisine  Expenditure
2   A3   Dominic   19    Indian        27.66
0   A1    Shilpa   18    Indian        24.65
3   A4     Ahmad   22  American        19.54
8   A9      Emma   24    Indian        18.88
1   A2  Jaspreet   32  American        18.54
4   A5    Joseph   28    Indian        17.32
9  A10    Gaurav   29   Chinese        14.43
5   A6      Saju   31    Indian        12.56
7   A8    Preeti   67  American        12.23
6   A7    Monica   48   Chinese        11.09

In [55]:
newroom.sort_values(['Cuisine','Expenditure'],ascending=False) # sorted according string not integer here the string priroties

  Room      Name  Age   Cuisine  Expenditure
2   A3   Dominic   19    Indian        27.66
0   A1    Shilpa   18    Indian        24.65
8   A9      Emma   24    Indian        18.88
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
9  A10    Gaurav   29   Chinese        14.43
6   A7    Monica   48   Chinese        11.09
3   A4     Ahmad   22  American        19.54
1   A2  Jaspreet   32  American        18.54
7   A8    Preeti   67  American        12.23

In [57]:
newroom.sort_index()

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [59]:
newroom.sort_index(ascending = False)

  Room      Name  Age   Cuisine  Expenditure
9  A10    Gaurav   29   Chinese        14.43
8   A9      Emma   24    Indian        18.88
7   A8    Preeti   67  American        12.23
6   A7    Monica   48   Chinese        11.09
5   A6      Saju   31    Indian        12.56
4   A5    Joseph   28    Indian        17.32
3   A4     Ahmad   22  American        19.54
2   A3   Dominic   19    Indian        27.66
1   A2  Jaspreet   32  American        18.54
0   A1    Shilpa   18    Indian        24.65

## Functions

In [64]:
newroom.round()

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian         25.0
1   A2  Jaspreet   32  American         19.0
2   A3   Dominic   19    Indian         28.0
3   A4     Ahmad   22  American         20.0
4   A5    Joseph   28    Indian         17.0
5   A6      Saju   31    Indian         13.0
6   A7    Monica   48   Chinese         11.0
7   A8    Preeti   67  American         12.0
8   A9      Emma   24    Indian         19.0
9  A10    Gaurav   29   Chinese         14.0

### apply()

In [69]:
def  first_three_number(row):
    row = row[0:3]
    return row

In [111]:
def mean (row):
    row = row *2
    return row

In [71]:
newroom.apply(first_three_number)

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66

In [75]:
newroom['Name'].apply(first_three_number)

0    Shi
1    Jas
2    Dom
3    Ahm
4    Jos
5    Saj
6    Mon
7    Pre
8    Emm
9    Gau
Name: Name, dtype: object

In [113]:
newroom['Expenditure'].apply(mean)

0    49.30
1    37.08
2    55.32
3    39.08
4    34.64
5    25.12
6    22.18
7    24.46
8    37.76
9    28.86
Name: Expenditure, dtype: float64

# Group Operations

In [116]:
newroom.groupby(['Cuisine'])

In [132]:
newroom.groupby(by = ['Cuisine']).mean(numeric_only = True)

                Age  Expenditure
Cuisine
American  40.333333        16.77
Chinese        38.5        12.76
Indian         24.0       20.214

In [138]:
import numpy as np

In [140]:
newroom.groupby(by='Cuisine')['Expenditure'].apply(np.mean)

Cuisine
American    16.770
Chinese     12.760
Indian      20.214
Name: Expenditure, dtype: float64

In [142]:
grouped_df = newroom.groupby('Cuisine')

summary_df = grouped_df.aggregate({'Expenditure': 'mean'})



print(summary_df)

          Expenditure
Cuisine
American        16.77
Chinese         12.76
Indian         20.214